In [1]:
import pandas as pd
import psycopg2

In [2]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

In [4]:
query = f'''select  *
        from public.vacancies
        limit 2
        '''

In [5]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,None,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,None,130,4903713

Задание 3.1
Сколько вакансий есть в базе?

In [6]:
query = f'''select 
      count(employment)
            from public.vacancies
        '''

In [7]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  49197

In [8]:
query = f'''select  *
        from public.areas
        limit 2
        '''

In [9]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     id     name
0  2758  Тбилиси
1     8   Майкоп

Задание 3.3
Сколько регионов?

In [10]:
query = f'''select  count(id)
        from public.areas
                '''

In [11]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1362

In [12]:
query = f'''select  *
        from public.employers
        limit 2
        '''

In [13]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

      id                              name  area
0   2393  Программный Продукт, ИТ-компания     1
1  72977                         БАРС Груп    88

Задание 3.2
Сколько работодателей?

In [14]:
query = f'''select  count(id)
        from public.employers
            '''

In [15]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  23501

In [16]:
query = f'''select  *
        from public.industries
        limit 2
        '''

In [17]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

      id                                               name
0  7.540                Разработка программного обеспечения
1  7.539  Системная интеграция,  автоматизации технологи...

Задание 3.4
Сколько сфер деятельности?

In [18]:
query = f'''select  count(id)
        from public.industries
        '''

In [19]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\3888653206.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    294

In [21]:
connection.close()

4. Детальный анализ вакансий

In [3]:
import pandas as pd
import psycopg2

In [4]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [5]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

Задание 4.1
Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Выберите пятёрку лидеров по количеству вакансий:

In [20]:
query = f'''select
        count(v.id) cnt,
        a.name
        from public.areas a
        join public.vacancies v on a.id = v.area_id
        group by  2
        order by 1 desc
        limit 5
        '''

In [21]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

    cnt             name
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

Задание 4.2
Посмотрим на зарплаты. У какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой?

In [22]:
query = f'''select
        count(v.id) cnt
        from public.vacancies v
        where (v.salary_from is not null or v.salary_to is not null)
        '''

In [23]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     cnt
0  24073

Задание 4.3
Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого числа.

In [24]:
query = f'''select
        round(avg(v.salary_from)),
        round(avg(v.salary_to))
        from public.vacancies v
        '''

In [25]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     round     round
0  71065.0  110537.0

Задание 4.4
Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Какая пара находится на втором месте по популярности?

In [26]:
query = f'''select
        v.id,
        v.schedule,
        v.employment
        from public.vacancies v
        group by 1, 2
        order by 1 desc
        limit 2
        '''

In [27]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

         id          schedule        employment
0  66196438       Полный день  Полная занятость
1  66196369  Удаленная работа  Полная занятость

Задание 4.5
Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [28]:
query = f'''select
        count(v.experience) cnt,
        v.experience
        from public.vacancies v
        group by 2
        order by 1
        '''

In [29]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     cnt          experience
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

In [1]:
import pandas as pd
import psycopg2

In [2]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

Задание 5.1
Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [30]:
query = f''' select
     e.name, count(v.id) cnt
from public.employers e
join public.vacancies v on e.id = v.employer_id
group by 1
order by 2 desc
limit 5
     '''

In [31]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            name   cnt
0         Яндекс  1933
1     Ростелеком   491
2       Тинькофф   444
3           СБЕР   428
4  Газпром нефть   331

Задание 5.2
Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей. Впишите его название в поле ниже в том виде, который вернул запрос.

In [32]:
query = f''' select
       a.name название_города,
       count(distinct e.id) номер_работодатель,
       count(v.id) id_вакансии
       from public.areas a
       left join public.vacancies v on a.id = v.area_id
       left join public.employers e on a.id = e.area
       where v.id is null
       group by 1
       order by 2 desc
       limit 1
       '''

In [33]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

  название_города  номер_работодатель  id_вакансии
0          Россия                 410            0

Задание 5.3
Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии.
Выберите максимальное значение из получившегося списка.

In [34]:
query = f''' select 
       count(distinct v.area_id) id_регион_вакансий,
       v.employer_id id_работодателя
       from public.vacancies v
       group by 2
       order by 1 desc
       limit 1
       '''

In [35]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   id_регион_вакансий  id_работодателя
0                 181             1740

Задание 5.4
Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.
Введите количество, которое вернул запрос, в поле ниже.

In [36]:
query = f''' select 
      count(e.id)
      from public.employers_industries ei
      right join public.industries i on i.id = ei.industry_id
      right join public.employers e on e.id = ei.employer_id
      where i.id is null
       '''

In [37]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   8419

Задание 5.5
Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.
Введите в поле ниже название этой компании так же, как оно указано в результате запроса.

In [38]:
query = f''' select 
      e.name, count(e.name) cnt
      from public.employers_industries ei
      right join public.industries i on i.id = ei.industry_id
      right join public.employers e on e.id = ei.employer_id
      group by 1
      having count(e.name) = 4
      order by 1
      limit 3
       '''

In [39]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           name  cnt
0  101 Интернет    4
1      21vek.by    4
2          2ГИС    4

Задание 5.6
С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана «Разработка программного обеспечения».

In [40]:
query = f''' select 
      count(e.id), i.name
      from public.employers_industries ei
      right join public.industries i on i.id = ei.industry_id
      right join public.employers e on e.id = ei.employer_id
      where i.name = 'Разработка программного обеспечения'
      group by 2
       '''

In [41]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count                                 name
0   3553  Разработка программного обеспечения

In [42]:
#industries i  деятельности
query = f''' select 
      i.id ID_сферы_деятельности, 
      i.name Название_деятельности
      from public.industries i
      where i.id = '7.541'
      group by 1,2
      order by 2
      limit 5
      '''

In [43]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

  id_сферы_деятельности                              Название_деятельности
0                 7.541  Интернет-компания (поисковики, платежные систе...

In [44]:
#employers_industries ei  работодателями и сферами
query = f''' select 
      ei.employer_id ID_работодателя, 
      ei.industry_id ID_сферы_деятельности
      from public.employers_industries ei
      where ei.employer_id = 1740
      group by 1,2
      order by 2
      limit 5
      '''

In [45]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   id_работодателя id_сферы_деятельности
0             1740                 7.541

In [46]:
#areas a  регион
query = f''' select *
      from public.cities c
      '''

In [47]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                                                city
0  [Москва, Санкт-Петербург, Новосибирск, Екатери...

In [48]:
#employers e  работодатели
query = f''' select 
      e.id Номер_работодателя, 
      e.name Название_работодателя,
      e.area Регион_регистрации
      from public.employers e
      where e.name = 'Яндекс'
      group by 1,2,3
      order by 3
      limit 5
      '''

In [49]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   Номер_работодателя Название_работодателя  Регион_регистрации
0                1740                Яндекс                   1

Задание 5.7
Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании, собранных в этой таблице. Должна получиться выборка такого вида (приведён пример результата для компании SberTech):

In [50]:
query = f''' select 
      a.name Название_города,
      count(v.id) cnt 
      from public.areas a 
      join public.vacancies v  on a.id = v.area_id
      where v.employer_id = 1740 and (a.name = 'Москва' or a.name = 'Санкт-Петербург' or a.name = 'Новосибирск'  or a.name = 'Екатеринбург' or a.name = 'Казань' or a.name = 'Нижний Новгород' or a.name = 'Челябинск' or a.name = 'Красноярск' or a.name = 'Самара'
      or a.name = 'Уфа' or a.name = 'Ростов-на-Дону' or a.name = 'Омск' or a.name = 'Краснодар' or a.name = 'Воронеж' or a.name = 'Пермь' or a.name = 'Волгоград')
      group by 1
      union all
      select 'total',
      count(2)
      from public.areas a
      join public.vacancies v  on a.id = v.area_id
      where v.employer_id = 1740 and (a.name = 'Москва' or a.name = 'Санкт-Петербург' or a.name = 'Новосибирск'  or a.name = 'Екатеринбург' or a.name = 'Казань' or a.name = 'Нижний Новгород' or a.name = 'Челябинск' or a.name = 'Красноярск' or a.name = 'Самара'
      or a.name = 'Уфа' or a.name = 'Ростов-на-Дону' or a.name = 'Омск' or a.name = 'Краснодар' or a.name = 'Воронеж' or a.name = 'Пермь' or a.name = 'Волгоград')
      group by 1
      order by 2 desc
      '''

In [51]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

    Название_города  cnt
0             total  485
1            Москва   54
2   Санкт-Петербург   42
3      Екатеринбург   39
4   Нижний Новгород   36
5       Новосибирск   35
6           Воронеж   32
7         Краснодар   30
8            Самара   26
9               Уфа   26
10           Казань   25
11            Пермь   25
12   Ростов-на-Дону   25
13        Волгоград   24
14       Красноярск   23
15        Челябинск   22
16             Омск   21

6. Предметный анализ
   ✍ Переходим к самому интересному — нам предстоит исследовать требования работодателей к дата-сайентистам.

In [1]:
import pandas as pd
import psycopg2

In [2]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

Задание 6.1
Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'
Сколько вакансий

In [52]:
query = f''' select count(2)

 from public.vacancies v
    where 
      name ilike '%данн%'
      or name ilike '%data%' 
          
       '''

In [53]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1771

Задание 6.2
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
В следующих заданиях мы продолжим работать с вакансиями по указанному выше условию (уже не учитывая вакансии уровня Junior).

In [54]:
query = f''' select *
     from public.vacancies v
     where name ilike '%junior%'
  limit 30
    '''

In [55]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,50533416,Junior+ CV/ML developer,Python\tSQL\tРабота в команде\tOpenCV\tML,Гибкий график,От 1 года до 3 лет,Полная занятость,NaN,NaN,4,80190
1,47216581,Project-manager ( Junior ) / Менеджер проекта ...,Бизнес-анализ\tУправление проектами\tОптимизац...,Полный день,Нет опыта,Полная занятость,35000.0,NaN,2,2619123
2,66113194,Junior Java-разработчик,None,Полный день,От 1 года до 3 лет,Полная занятость,NaN,NaN,1,3529
3,55873241,Junior product manager,MS PowerPoint\tМаркетинговые исследования\tInt...,Удаленная работа,От 1 года до 3 лет,Полная занятость,80000.0,NaN,23,48090
4,50368862,Менеджер-аналитик / junior,None,Полный день,Нет опыта,Полная занятость,40000.0,NaN,2,2619123
5,54743984,Junior/Middle full-stack web developer (Bitrix...,Веб-программирование\tPHP\tPHP5\t1С-Битрикс\tY...,Полный день,От 1 года до 3 лет,Полная занятость,75000.0,100000.0,54,3177
6,54825318,Data Scientist (Junior+),Python\tOpenCV\tTensorflow\tComputer Vision\tН...,Полный день,От 1 года до 3 лет,Полная занятость,50000.0,70000.0,72,215942
7,55332731,Junior PHP-разработчик,PHP\tJavaScript\tHTML\tCSS\tjQuery\tMySQL\tGit...,Гибкий график,Нет опыта,Полная занятость,35000.0,NaN,4,824443
8,55002009,Разработчик учебного портала (Webtutor) junior,JavaScript\tHTML\tCSS\tПланирование карьеры\tБ...,Полный день,От 1 года до 3 лет,Полная занятость,NaN,NaN,43,33305
9,55856775,Web-разработчик Junior (Fullstack-developer),None,Полный день,Нет опыта,Полная занятость,30000.0,60000.0,66,2117135
10,52990867,SalesForce junior developer,None,Полный день,От 1 года до 3 лет,Полная занятость,NaN,NaN,76,77301
11,55350191,"Бизнес-аналитик (аналитик по бизнес процессам,...",Работа в команде\tMS PowerPoint\tВедение отчет...,Полный день,От 1 года до 3 лет,Полная занятость,NaN,NaN,1,2733062
12,55350343,Junior iOS-разработчик/стажер (Kolesa Academy),iOS\tООП\tSwift\tGit\tObjective-C,Полный день,Нет опыта,Стажировка,18307.0,18307.0,159,40662
13,55350344,Junior iOS-разработчик/стажер (Kolesa Academy),iOS\tООП\tSwift\tGit\tObjective-C,Полный день,Нет опыта,Стажировка,18307.0,18307.0,160,40662
14,55350345,Junior iOS-разработчик/стажер (Kolesa Academy),iOS\tООП\tSwift\tGit\tObjective-C,Полный день,Нет опыта,Стажировка,18307.0,18307.0,177,40662
15,55405029,Разработчик Java (Junior/Middle),Git\tJava\tSpring Framework\tООП\tLinux,Полный день,От 1 года до 3 лет,Полная занятость,NaN,NaN,2760,6069017
16,55088390,Junior фронтенд-разработчик React,Git\tCSS\tJavaScript\tLinux\tHTML\tReact\tmobx...,Полный день,От 1 года до 3 лет,Полная занятость,50000.0,90000.0,3,4540675
17,55350549,Junior Consultant/Automation Specialist (Marke...,Английский язык\tSalesforce\tHTML/CSS,Гибкий график,От 1 года до 3 лет,Полная занятость,NaN,NaN,1002,1516877
18,55198963,Программист-разработчик (Junior),SQL\tBPMN\tMS SQL\tC#\tАвтоматизация процессов...,Полный день,От 1 года до 3 лет,Полная занятость,30000.0,50000.0,96,1561536
19,55201007,Junior Веб-разработчик,CMS Wordpress\tPHP\tHTML\tJoomla CMS\tCSS\t1С-...,Удаленная работа,От 1 года до 3 лет,Частичная занятость,NaN,NaN,1002,2786052
20,50894440,Junior Frontend разработчик (React),TypeScript\tWebpack\tReact\tJavaScript\tFronte...,Гибкий график,От 1 года до 3 лет,Полная занятость,90000.0,NaN,1,2515455
21,55373400,Junior /Ї Middle Unity Developer,Git\tC#\tUnity\tООП\tC++,Удаленная работа,От 1 года до 3 лет,Полная занятость,29224.0,46759.0,115,5197055
22,55279308,"Mobile developer (Android, iOS) junior",Git\tReact Native\tRedux\tDart\tTypeScript\tHT...,Полный день,От 1 года до 3 лет,Полная занятость,40000.0,60000.0,90,5560707
23,55351334,Junior Fullstack PHP developer,Git\tJavaScript\tMySQL\tООП\tPHP\tLinux\tCSS\t...,Полный день,От 1 года до 3 лет,Полная занятость,55000.0,70000.0,73,1367924
24,54983814,Junior QA Engineer Android/iOS,Atlassian Jira\tФункциональное тестирование\tT...,Полный день,От 1 года до 3 лет,Полная занятость,25000.0,35000.0,19,1748732
25,55352674,Junior Product/Project Manager,Product Management\tAgile Project Management\t...,Полный день,Нет опыта,Полная занятость,25000.0,50000.0,2,4888751
26,55883476,Разработчик No-code/Low-code (junior),Обучение и развитие\tСистемное мышление\tБитри...,Полный день,Нет опыта,Полная занятость,30000.0,40000.0,63,1319572
27,54828856,Junior Android developer,None,Полный день,Нет опыта,Полная занятость,NaN,NaN,19,1748732
28,55218546,Junior/Middle/Senior 1C Developer/ Программист 1с,1С: Предприятие 8\tСоздание конфигурации 1С\t1...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,95,1922805
29,54829002,Junior Web-программист (PHP+Vue.js),None,Полный день,Нет опыта,Полная занятость,50000.0,NaN,19,1748732

Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
‘data scientist’;
‘data science’;
‘исследователь данных’;
‘ML’ (здесь не нужно брать вакансии по HTML);
‘machine learning’;
‘машинн%обучен%’.

Считаем вакансиями для специалистов уровня Junior следующие:
в названии есть слово “junior” или
требуемый опыт — «Нет опыта» или
тип трудоустройства — «Стажировка».

In [56]:
query = f''' select count(*)
     from public.vacancies v
     where 
     name ilike '%data scientist%'
     or name ilike '%data science%'
     or name ilike '%исследователь данных%'
     or name ilike '%ML%' 
     and name not ilike '%HTML%'
     or name ilike '%machine learning%'
     or name ilike '%машинн%обучен%'
     and name ilike '%junior%'
     and experience ilike '%Нет опыта%'
     and employment ilike '%Стажировка%'
    '''

In [57]:
df = pd.read_sql_query(query, connection)
df

C:\Users\St965\AppData\Local\Temp\ipykernel_21472\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    524